/*
answer = [];
let table = document.getElementsByTagName("table")[0];

for (let i = 0; i < table.rows.length; i++) {
    let row = table.rows[i].cells;
    let damageType = row[6].textContent.split(', ');
    damageType = damageType.map (item => item = item.toLowerCase());
    let material = row[8].textContent.split(', ');
    material = material.map (item => item = item.toLowerCase())

    answer[i] = {
        'Наименование': row[0].textContent.toLowerCase(),
        'Тип оружия': row[1].textContent.toLowerCase(),
        'Длина, см': +row[2].textContent,
        'Дистанция': row[4].textContent.toLowerCase(),
        'Вес, кг': +row[5].textContent,
        'Тип урона': damageType,
        'Происхождение': row[7].textContent.toLowerCase(),
        'Материал': material,
        'Время': +row[9].textContent
    }
}

console.log(answer);
//*/

export var weapons = [
    {
        "Наименование": "хопеш",
        "Тип оружия": "клинковое оружие",
        "Длина, см": 50,
        "Дистанция": "ближняя",
        "Вес, кг": 2,
        "Тип урона": [
            "рубящий"
        ],
        "Происхождение": "египет",
        "Материал": [
            "сталь",
            "медь",
            "бронза",
            "дерево"
        ],
        "Время": -20
    },
    {
        "Наименование": "палка",
        "Тип оружия": "холодное оружие",
        "Длина, см": 50,
        "Дистанция": "ближняя",
        "Вес, кг": null,
        "Тип урона": [
            "ударно-дробящий",
            "колющий"
        ],
        "Происхождение": "-",
        "Материал": [
            "дерево"
        ],
        "Время": -3000000
    },
    {
        "Наименование": "акинак",
        "Тип оружия": "клинковое оружие",
        "Длина, см": 35,
        "Дистанция": "ближняя",
        "Вес, кг": 2,
        "Тип урона": [
            "колющий"
        ],
        "Происхождение": "иран",
        "Материал": [
            "сталь",
            "железо"
        ],
        "Время": -10
    },
    {
        "Наименование": "каролингский меч",
        "Тип оружия": "длинный меч",
        "Длина, см": 100,
        "Дистанция": "ближняя",
        "Вес, кг": null,
        "Тип урона": [
            "рубящий",
            "колющий"
        ],
        "Происхождение": "франция",
        "Материал": [
            "металл"
        ],
        "Время": 8
    },
    {
        "Наименование": "спата",
        "Тип оружия": "одноручный меч",
        "Длина, см": 60,
        "Дистанция": "ближняя",
        "Вес, кг": 2,
        "Тип урона": [
            "рубяще-колющий"
        ],
        "Происхождение": "франция",
        "Материал": [
            "сталь",
            "железо",
            "металл",
            "бронза"
        ],
        "Время": 1
    },
    {
        "Наименование": "испанский гладиус",
        "Тип оружия": "одноручный меч",
        "Длина, см": 60,
        "Дистанция": "ближняя",
        "Вес, кг": null,
        "Тип урона": [
            "колющий"
        ],
        "Происхождение": "италия",
        "Материал": [
            "сталь",
            "железо",
            "металл",
            "бронза"
        ],
        "Время": -4
    },
    {
        "Наименование": "гладиус \"майнц\"",
        "Тип оружия": "одноручный меч",
        "Длина, см": 65,
        "Дистанция": "ближняя",
        "Вес, кг": null,
        "Тип урона": [
            "колющий"
        ],
        "Происхождение": "италия",
        "Материал": [
            "сталь",
            "железо",
            "металл",
            "бронза"
        ],
        "Время": -4
    },
    {
        "Наименование": "гладиус \"фулхэм\"",
        "Тип оружия": "одноручный меч",
        "Длина, см": 65,
        "Дистанция": "ближняя",
        "Вес, кг": null,
        "Тип урона": [
            "колющий"
        ],
        "Происхождение": "италия",
        "Материал": [
            "сталь",
            "железо",
            "металл",
            "бронза"
        ],
        "Время": -4
    },
    {
        "Наименование": "гладиус \"помпеи\"",
        "Тип оружия": "одноручный меч",
        "Длина, см": 60,
        "Дистанция": "ближняя",
        "Вес, кг": null,
        "Тип урона": [
            "колющий"
        ],
        "Происхождение": "италия",
        "Материал": [
            "сталь",
            "железо",
            "металл",
            "бронза"
        ],
        "Время": -4
    },
    {
        "Наименование": "ксифос",
        "Тип оружия": "клинковое оружие",
        "Длина, см": 60,
        "Дистанция": "ближняя",
        "Вес, кг": 3,
        "Тип урона": [
            "рубяще-колющий"
        ],
        "Происхождение": "греция",
        "Материал": [
            "бронза",
            "железо"
        ],
        "Время": -9
    },
    {
        "Наименование": "кончар",
        "Тип оружия": "двуручный меч",
        "Длина, см": 150,
        "Дистанция": "средняя",
        "Вес, кг": null,
        "Тип урона": [
            "колюще-режущий"
        ],
        "Происхождение": "польша",
        "Материал": [
            "металл",
            "кожа"
        ],
        "Время": 12
    },
    {
        "Наименование": "эсток",
        "Тип оружия": "холодное оружие",
        "Длина, см": 150,
        "Дистанция": "ближняя",
        "Вес, кг": 1,
        "Тип урона": [
            "колющий"
        ],
        "Происхождение": "франция",
        "Материал": [
            "сталь"
        ],
        "Время": 14
    },
    {
        "Наименование": "фламберг",
        "Тип оружия": "полуторный меч",
        "Длина, см": 100,
        "Дистанция": "средняя",
        "Вес, кг": 4,
        "Тип урона": [
            "рубяще-режущий"
        ],
        "Происхождение": "германия",
        "Материал": [
            "качественная сталь"
        ],
        "Время": 15
    },
    {
        "Наименование": "копис",
        "Тип оружия": "клинковое оружие",
        "Длина, см": 50,
        "Дистанция": "ближняя",
        "Вес, кг": 2,
        "Тип урона": [
            "рубящий",
            "колющий"
        ],
        "Происхождение": "греция",
        "Материал": [
            "сталь",
            "медь",
            "дерево"
        ],
        "Время": -5
    },
    {
        "Наименование": "катана",
        "Тип оружия": "холодное оружие",
        "Длина, см": 70,
        "Дистанция": "ближняя",
        "Вес, кг": 1,
        "Тип урона": [
            "колюще-режущий"
        ],
        "Происхождение": "япония",
        "Материал": [
            "сталь"
        ],
        "Время": 15
    },
    {
        "Наименование": "вакидзаси",
        "Тип оружия": "холодное оружие",
        "Длина, см": 50,
        "Дистанция": "ближняя",
        "Вес, кг": null,
        "Тип урона": [
            "колюще-режущий"
        ],
        "Происхождение": "япония",
        "Материал": [
            "сталь"
        ],
        "Время": 15
    },
    {
        "Наименование": "скрамасакс",
        "Тип оружия": "короткий меч",
        "Длина, см": 35,
        "Дистанция": "ближняя",
        "Вес, кг": null,
        "Тип урона": [
            "режущий",
            "колющий"
        ],
        "Происхождение": "германия",
        "Материал": [
            "дерево",
            "кожа",
            "кость",
            "сталь"
        ],
        "Время": 2
    },
    {
        "Наименование": "сакс",
        "Тип оружия": "нож",
        "Длина, см": 30,
        "Дистанция": "ближняя",
        "Вес, кг": null,
        "Тип урона": [
            "режущий",
            "колющий"
        ],
        "Происхождение": "германия",
        "Материал": [
            "металл"
        ],
        "Время": 1
    },
    {
        "Наименование": "фальшион",
        "Тип оружия": "одноручный меч",
        "Длина, см": 80,
        "Дистанция": "ближняя",
        "Вес, кг": null,
        "Тип урона": [
            "рубящий",
            "колющий"
        ],
        "Происхождение": "франция",
        "Материал": [
            "сталь"
        ],
        "Время": 13
    },
    {
        "Наименование": "алебарда",
        "Тип оружия": "древковое оружие",
        "Длина, см": 200,
        "Дистанция": "средняя",
        "Вес, кг": 4,
        "Тип урона": [
            "рубящий",
            "колющий"
        ],
        "Происхождение": "германия",
        "Материал": [
            "дерево",
            "сталь"
        ],
        "Время": 13
    },
    {
        "Наименование": "бердыш",
        "Тип оружия": "древковое оружие",
        "Длина, см": 170,
        "Дистанция": "средняя",
        "Вес, кг": 3,
        "Тип урона": [
            "дробящий",
            "рубящий"
        ],
        "Происхождение": "россия",
        "Материал": [
            "металл  ",
            "дерево"
        ],
        "Время": 15
    },
    {
        "Наименование": "шест",
        "Тип оружия": "холодное оружие",
        "Длина, см": 200,
        "Дистанция": "средняя",
        "Вес, кг": null,
        "Тип урона": [
            "ударно-дробящий"
        ],
        "Происхождение": "китай",
        "Материал": [
            "дерево",
            "металл"
        ],
        "Время": null
    },
    {
        "Наименование": "вульж",
        "Тип оружия": "древковое оружие",
        "Длина, см": 180,
        "Дистанция": "средняя",
        "Вес, кг": 3,
        "Тип урона": [
            "колюще-рубящий"
        ],
        "Происхождение": "франция",
        "Материал": [
            "сталь",
            "дерево"
        ],
        "Время": 14
    },
    {
        "Наименование": "глефа",
        "Тип оружия": "древковое оружие",
        "Длина, см": 200,
        "Дистанция": "дистанция",
        "Вес, кг": 3,
        "Тип урона": [
            "колющий"
        ],
        "Происхождение": "франция",
        "Материал": [
            "сталь",
            "дерево"
        ],
        "Время": 14
    },
    {
        "Наименование": "итальянский кинжал",
        "Тип оружия": "короткоклинковое оружие",
        "Длина, см": 45,
        "Дистанция": "ближняя",
        "Вес, кг": null,
        "Тип урона": [
            "колющий"
        ],
        "Происхождение": "италия",
        "Материал": [
            "железо"
        ],
        "Время": 18
    },
    {
        "Наименование": "датский топор",
        "Тип оружия": "двуручный топор",
        "Длина, см": 180,
        "Дистанция": "средняя",
        "Вес, кг": null,
        "Тип урона": [
            "рубяще-режущий"
        ],
        "Происхождение": "дания",
        "Материал": [
            "металл",
            "дерево"
        ],
        "Время": 10
    }
];